; domain
(define (domain BLOCKS)

(:requirements :negative-preconditions
  	:typing
)

(:types block)

(:predicates (on ?x - block ?y - block) (ontable ?x - block) (clear ?x - block) (handempty) (holding ?x - block))

(:action pick-up
  :parameters (?x - block)
  :precondition (and (clear ?x) (ontable ?x) (handempty))
  :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x)))

(:action put-down
  :parameters (?x - block)
  :precondition (holding ?x)
  :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x)))

(:action stack
  :parameters (?x - block ?y - block)
  :precondition (and (holding ?x) (clear ?y))
  :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y)))

(:action unstack
  :parameters (?x - block ?y - block)
  :precondition (and (on ?x ?y) (clear ?x) (handempty))
  :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y))))

)

; problem
(define (problem p13)
(:domain blocks)
(:objects
 b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 - block
)
(:init
(handempty)
(ontable b11)
(clear b16)
(on b4 b11)
(on b18 b4)
(on b17 b18)
(on b13 b17)
(on b10 b13)
(on b9 b10)
(on b23 b9)
(on b24 b23)
(on b5 b24)
(on b6 b5)
(on b25 b6)
(on b12 b25)
(on b2 b12)
(on b21 b2)
(on b16 b21)
(ontable b22)
(clear b8)
(on b19 b22)
(on b15 b19)
(on b27 b15)
(on b28 b27)
(on b7 b28)
(on b14 b7)
(on b29 b14)
(on b30 b29)
(on b8 b30)
(ontable b20)
(clear b1)
(on b1 b20)
(ontable b3)
(clear b26)
(on b26 b3)
)
(:goal (and
(on b12 b9)
(on b30 b12)
(on b20 b30)
(on b21 b20)
(on b14 b21)
(on b7 b14)
(on b4 b7)
(on b11 b4)
(on b27 b11)
(on b17 b27)
(on b28 b17)
(on b22 b28)
(on b18 b22)
(on b2 b18)
(on b10 b2)
(on b26 b10)
(on b13 b26)
(on b16 b13)
(on b15 b16)
(on b25 b15)
(on b29 b25)
(on b6 b29)
(on b23 b6)
(on b19 b23)
(on b5 b19)
(on b8 b5)
(on b1 b8)
(on b3 b1)
(on b24 b3)
))
)

; plan
1. (unstack b16 b21)
   deleted: (clear b16) (handempty) (on b16 b21)
   added: (holding b16) (clear b21)
   goals met: 0 of 29
2. (put-down b16)
   deleted: (holding b16)
   added: (clear b16) (handempty) (ontable b16)
   goals met: 0 of 29
3. (unstack b21 b2)
   deleted: (clear b21) (handempty) (on b21 b2)
   added: (holding b21) (clear b2)
   goals met: 0 of 29
4. (put-down b21)
   deleted: (holding b21)
   added: (clear b21) (handempty) (ontable b21)
   goals met: 0 of 29
5. (unstack b2 b12)
   deleted: (clear b2) (handempty) (on b2 b12)
   added: (holding b2) (clear b12)
   goals met: 0 of 29
6. (put-down b2)
   deleted: (holding b2)
   added: (clear b2) (handempty) (ontable b2)
   goals met: 0 of 29
7. (unstack b12 b25)
   deleted: (clear b12) (handempty) (on b12 b25)
   added: (holding b12) (clear b25)
   goals met: 0 of 29
8. (put-down b12)
   deleted: (holding b12)
   added: (clear b12) (handempty) (ontable b12)
   goals met: 0 of 29
9. (unstack b25 b6)
   deleted: (clear b25) (handempty) (on b25 b6)
   added: (holding b25) (clear b6)
   goals met: 0 of 29
10. (put-down b25)
   deleted: (holding b25)
   added: (clear b25) (handempty) (ontable b25)
   goals met: 0 of 29
11. (unstack b6 b5)
   deleted: (clear b6) (handempty) (on b6 b5)
   added: (holding b6) (clear b5)
   goals met: 0 of 29
12. (put-down b6)
   deleted: (holding b6)
   added: (clear b6) (handempty) (ontable b6)
   goals met: 0 of 29
13. (unstack b5 b24)
   deleted: (clear b5) (handempty) (on b5 b24)
   added: (holding b5) (clear b24)
   goals met: 0 of 29
14. (put-down b5)
   deleted: (holding b5)
   added: (clear b5) (handempty) (ontable b5)
   goals met: 0 of 29
15. (unstack b24 b23)
   deleted: (clear b24) (handempty) (on b24 b23)
   added: (holding b24) (clear b23)
   goals met: 0 of 29
16. (put-down b24)
   deleted: (holding b24)
   added: (clear b24) (handempty) (ontable b24)
   goals met: 0 of 29
17. (unstack b23 b9)
   deleted: (clear b23) (handempty) (on b23 b9)
   added: (holding b23) (clear b9)
   goals met: 0 of 29
18. (put-down b23)
   deleted: (holding b23)
   added: (clear b23) (handempty) (ontable b23)
   goals met: 0 of 29
19. (unstack b9 b10)
   deleted: (clear b9) (handempty) (on b9 b10)
   added: (holding b9) (clear b10)
   goals met: 0 of 29
20. (put-down b9)
   deleted: (holding b9)
   added: (clear b9) (handempty) (ontable b9)
   goals met: 0 of 29
21. (unstack b10 b13)
   deleted: (clear b10) (handempty) (on b10 b13)
   added: (holding b10) (clear b13)
   goals met: 0 of 29
22. (put-down b10)
   deleted: (holding b10)
   added: (clear b10) (handempty) (ontable b10)
   goals met: 0 of 29
23. (unstack b13 b17)
   deleted: (clear b13) (handempty) (on b13 b17)
   added: (holding b13) (clear b17)
   goals met: 0 of 29
24. (put-down b13)
   deleted: (holding b13)
   added: (clear b13) (handempty) (ontable b13)
   goals met: 0 of 29
25. (unstack b17 b18)
   deleted: (clear b17) (handempty) (on b17 b18)
   added: (holding b17) (clear b18)
   goals met: 0 of 29
26. (put-down b17)
   deleted: (holding b17)
   added: (clear b17) (handempty) (ontable b17)
   goals met: 0 of 29
27. (unstack b18 b4)
   deleted: (clear b18) (handempty) (on b18 b4)
   added: (holding b18) (clear b4)
   goals met: 0 of 29
28. (put-down b18)
   deleted: (holding b18)
   added: (clear b18) (handempty) (ontable b18)
   goals met: 0 of 29
29. (unstack b4 b11)
   deleted: (clear b4) (handempty) (on b4 b11)
   added: (holding b4) (clear b11)
   goals met: 0 of 29
30. (put-down b4)
   deleted: (holding b4)
   added: (clear b4) (handempty) (ontable b4)
   goals met: 0 of 29
31. (unstack b8 b30)
   deleted: (clear b8) (handempty) (on b8 b30)
   added: (holding b8) (clear b30)
   goals met: 0 of 29
32. (put-down b8)
   deleted: (holding b8)
   added: (clear b8) (handempty) (ontable b8)
   goals met: 0 of 29
33. (unstack b30 b29)
   deleted: (clear b30) (handempty) (on b30 b29)
   added: (holding b30) (clear b29)
   goals met: 0 of 29
34. (put-down b30)
   deleted: (holding b30)
   added: (clear b30) (handempty) (ontable b30)
   goals met: 0 of 29
35. (unstack b29 b14)
   deleted: (clear b29) (handempty) (on b29 b14)
   added: (holding b29) (clear b14)
   goals met: 0 of 29
36. (put-down b29)
   deleted: (holding b29)
   added: (clear b29) (handempty) (ontable b29)
   goals met: 0 of 29
37. (unstack b14 b7)
   deleted: (clear b14) (handempty) (on b14 b7)
   added: (holding b14) (clear b7)
   goals met: 0 of 29
38. (put-down b14)
   deleted: (holding b14)
   added: (clear b14) (handempty) (ontable b14)
   goals met: 0 of 29
39. (unstack b7 b28)
   deleted: (clear b7) (handempty) (on b7 b28)
   added: (holding b7) (clear b28)
   goals met: 0 of 29
40. (put-down b7)
   deleted: (holding b7)
   added: (clear b7) (handempty) (ontable b7)
   goals met: 0 of 29
41. (unstack b28 b27)
   deleted: (clear b28) (handempty) (on b28 b27)
   added: (holding b28) (clear b27)
   goals met: 0 of 29
42. (put-down b28)
   deleted: (holding b28)
   added: (clear b28) (handempty) (ontable b28)
   goals met: 0 of 29
43. (unstack b27 b15)
   deleted: (clear b27) (handempty) (on b27 b15)
   added: (holding b27) (clear b15)
   goals met: 0 of 29
44. (put-down b27)
   deleted: (holding b27)
   added: (clear b27) (handempty) (ontable b27)
   goals met: 0 of 29
45. (unstack b15 b19)
   deleted: (clear b15) (handempty) (on b15 b19)
   added: (holding b15) (clear b19)
   goals met: 0 of 29
46. (put-down b15)
   deleted: (holding b15)
   added: (clear b15) (handempty) (ontable b15)
   goals met: 0 of 29
47. (unstack b19 b22)
   deleted: (clear b19) (handempty) (on b19 b22)
   added: (holding b19) (clear b22)
   goals met: 0 of 29
48. (put-down b19)
   deleted: (holding b19)
   added: (clear b19) (handempty) (ontable b19)
   goals met: 0 of 29
49. (unstack b1 b20)
   deleted: (clear b1) (handempty) (on b1 b20)
   added: (holding b1) (clear b20)
   goals met: 0 of 29
50. (put-down b1)
   deleted: (holding b1)
   added: (clear b1) (handempty) (ontable b1)
   goals met: 0 of 29
51. (unstack b26 b3)
   deleted: (clear b26) (handempty) (on b26 b3)
   added: (holding b26) (clear b3)
   goals met: 0 of 29
52. (put-down b26)
   deleted: (holding b26)
   added: (clear b26) (handempty) (ontable b26)
   goals met: 0 of 29
53. (pick-up b12)
   deleted: (ontable b12) (clear b12) (handempty)
   added: (holding b12)
   goals met: 0 of 29
54. (stack b12 b9)
   deleted: (holding b12) (clear b9)
   added: (clear b12) (handempty) (on b12 b9)
   goals met: 1 of 29
55. (pick-up b30)
   deleted: (ontable b30) (clear b30) (handempty)
   added: (holding b30)
   goals met: 1 of 29
56. (stack b30 b12)
   deleted: (holding b30) (clear b12)
   added: (clear b30) (handempty) (on b30 b12)
   goals met: 2 of 29
57. (pick-up b20)
   deleted: (ontable b20) (clear b20) (handempty)
   added: (holding b20)
   goals met: 2 of 29
58. (stack b20 b30)
   deleted: (holding b20) (clear b30)
   added: (clear b20) (handempty) (on b20 b30)
   goals met: 3 of 29
59. (pick-up b21)
   deleted: (ontable b21) (clear b21) (handempty)
   added: (holding b21)
   goals met: 3 of 29
60. (stack b21 b20)
   deleted: (holding b21) (clear b20)
   added: (clear b21) (handempty) (on b21 b20)
   goals met: 4 of 29
61. (pick-up b14)
   deleted: (ontable b14) (clear b14) (handempty)
   added: (holding b14)
   goals met: 4 of 29
62. (stack b14 b21)
   deleted: (holding b14) (clear b21)
   added: (clear b14) (handempty) (on b14 b21)
   goals met: 5 of 29
63. (pick-up b7)
   deleted: (ontable b7) (clear b7) (handempty)
   added: (holding b7)
   goals met: 5 of 29
64. (stack b7 b14)
   deleted: (holding b7) (clear b14)
   added: (clear b7) (handempty) (on b7 b14)
   goals met: 6 of 29
65. (pick-up b4)
   deleted: (ontable b4) (clear b4) (handempty)
   added: (holding b4)
   goals met: 6 of 29
66. (stack b4 b7)
   deleted: (holding b4) (clear b7)
   added: (clear b4) (handempty) (on b4 b7)
   goals met: 7 of 29
67. (pick-up b11)
   deleted: (ontable b11) (clear b11) (handempty)
   added: (holding b11)
   goals met: 7 of 29
68. (stack b11 b4)
   deleted: (holding b11) (clear b4)
   added: (clear b11) (handempty) (on b11 b4)
   goals met: 8 of 29
69. (pick-up b27)
   deleted: (ontable b27) (clear b27) (handempty)
   added: (holding b27)
   goals met: 8 of 29
70. (stack b27 b11)
   deleted: (holding b27) (clear b11)
   added: (clear b27) (handempty) (on b27 b11)
   goals met: 9 of 29
71. (pick-up b17)
   deleted: (ontable b17) (clear b17) (handempty)
   added: (holding b17)
   goals met: 9 of 29
72. (stack b17 b27)
   deleted: (holding b17) (clear b27)
   added: (clear b17) (handempty) (on b17 b27)
   goals met: 10 of 29
73. (pick-up b28)
   deleted: (ontable b28) (clear b28) (handempty)
   added: (holding b28)
   goals met: 10 of 29
74. (stack b28 b17)
   deleted: (holding b28) (clear b17)
   added: (clear b28) (handempty) (on b28 b17)
   goals met: 11 of 29
75. (pick-up b22)
   deleted: (ontable b22) (clear b22) (handempty)
   added: (holding b22)
   goals met: 11 of 29
76. (stack b22 b28)
   deleted: (holding b22) (clear b28)
   added: (clear b22) (handempty) (on b22 b28)
   goals met: 12 of 29
77. (pick-up b18)
   deleted: (ontable b18) (clear b18) (handempty)
   added: (holding b18)
   goals met: 12 of 29
78. (stack b18 b22)
   deleted: (holding b18) (clear b22)
   added: (clear b18) (handempty) (on b18 b22)
   goals met: 13 of 29
79. (pick-up b2)
   deleted: (ontable b2) (clear b2) (handempty)
   added: (holding b2)
   goals met: 13 of 29
80. (stack b2 b18)
   deleted: (holding b2) (clear b18)
   added: (clear b2) (handempty) (on b2 b18)
   goals met: 14 of 29
81. (pick-up b10)
   deleted: (ontable b10) (clear b10) (handempty)
   added: (holding b10)
   goals met: 14 of 29
82. (stack b10 b2)
   deleted: (holding b10) (clear b2)
   added: (clear b10) (handempty) (on b10 b2)
   goals met: 15 of 29
83. (pick-up b26)
   deleted: (ontable b26) (clear b26) (handempty)
   added: (holding b26)
   goals met: 15 of 29
84. (stack b26 b10)
   deleted: (holding b26) (clear b10)
   added: (clear b26) (handempty) (on b26 b10)
   goals met: 16 of 29
85. (pick-up b13)
   deleted: (ontable b13) (clear b13) (handempty)
   added: (holding b13)
   goals met: 16 of 29
86. (stack b13 b26)
   deleted: (holding b13) (clear b26)
   added: (clear b13) (handempty) (on b13 b26)
   goals met: 17 of 29
87. (pick-up b16)
   deleted: (ontable b16) (clear b16) (handempty)
   added: (holding b16)
   goals met: 17 of 29
88. (stack b16 b13)
   deleted: (holding b16) (clear b13)
   added: (clear b16) (handempty) (on b16 b13)
   goals met: 18 of 29
89. (pick-up b15)
   deleted: (ontable b15) (clear b15) (handempty)
   added: (holding b15)
   goals met: 18 of 29
90. (stack b15 b16)
   deleted: (holding b15) (clear b16)
   added: (clear b15) (handempty) (on b15 b16)
   goals met: 19 of 29
91. (pick-up b25)
   deleted: (ontable b25) (clear b25) (handempty)
   added: (holding b25)
   goals met: 19 of 29
92. (stack b25 b15)
   deleted: (holding b25) (clear b15)
   added: (clear b25) (handempty) (on b25 b15)
   goals met: 20 of 29
93. (pick-up b29)
   deleted: (ontable b29) (clear b29) (handempty)
   added: (holding b29)
   goals met: 20 of 29
94. (stack b29 b25)
   deleted: (holding b29) (clear b25)
   added: (clear b29) (handempty) (on b29 b25)
   goals met: 21 of 29
95. (pick-up b6)
   deleted: (ontable b6) (clear b6) (handempty)
   added: (holding b6)
   goals met: 21 of 29
96. (stack b6 b29)
   deleted: (holding b6) (clear b29)
   added: (clear b6) (handempty) (on b6 b29)
   goals met: 22 of 29
97. (pick-up b23)
   deleted: (ontable b23) (clear b23) (handempty)
   added: (holding b23)
   goals met: 22 of 29
98. (stack b23 b6)
   deleted: (holding b23) (clear b6)
   added: (clear b23) (handempty) (on b23 b6)
   goals met: 23 of 29
99. (pick-up b19)
   deleted: (ontable b19) (clear b19) (handempty)
   added: (holding b19)
   goals met: 23 of 29
100. (stack b19 b23)
   deleted: (holding b19) (clear b23)
   added: (clear b19) (handempty) (on b19 b23)
   goals met: 24 of 29
101. (pick-up b5)
   deleted: (ontable b5) (clear b5) (handempty)
   added: (holding b5)
   goals met: 24 of 29
102. (stack b5 b19)
   deleted: (holding b5) (clear b19)
   added: (clear b5) (handempty) (on b5 b19)
   goals met: 25 of 29
103. (pick-up b8)
   deleted: (ontable b8) (clear b8) (handempty)
   added: (holding b8)
   goals met: 25 of 29
104. (stack b8 b5)
   deleted: (holding b8) (clear b5)
   added: (clear b8) (handempty) (on b8 b5)
   goals met: 26 of 29
105. (pick-up b1)
   deleted: (ontable b1) (clear b1) (handempty)
   added: (holding b1)
   goals met: 26 of 29
106. (stack b1 b8)
   deleted: (holding b1) (clear b8)
   added: (clear b1) (handempty) (on b1 b8)
   goals met: 27 of 29
107. (pick-up b3)
   deleted: (ontable b3) (clear b3) (handempty)
   added: (holding b3)
   goals met: 27 of 29
108. (stack b3 b1)
   deleted: (holding b3) (clear b1)
   added: (clear b3) (handempty) (on b3 b1)
   goals met: 28 of 29
109. (pick-up b24)
   deleted: (ontable b24) (clear b24) (handempty)
   added: (holding b24)
   goals met: 28 of 29
110. (stack b24 b3)
   deleted: (holding b24) (clear b3)
   added: (clear b24) (handempty) (on b24 b3)
   goals met: 29 of 29
